Revit 2027 API
ParameterTypeId.FamilyIsParametric Property
 "Is parametric"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FamilyIsParametric { get; }
Public Shared ReadOnly Property FamilyIsParametric As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FamilyIsParametric {
	ForgeTypeId^ get ();
}
static member FamilyIsParametric : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace